"""
transliteration_map.py

Этот модуль содержит словарь `transliteration_map`, который используется для транслитерации 
латинских символов в кириллические. Транслитерация — это процесс преобразования текста 
из одной письменности в другую, сохраняя при этом произношение.

Структура словаря:
- Ключи: Латинские буквы и сочетания букв (например, 'a', 'b', 'yo', 'zh').
- Значения: Соответствующие кириллические буквы или их варианты. Некоторые ключи имеют 
  массив значений, что позволяет учитывать различные варианты написания.

Примеры использования:
- Ключ 'a' преобразуется в 'а'.
- Ключ 'b' преобразуется в 'б'.
- Ключ 'yo' преобразуется в 'ё'.
- Ключ 'z' может быть преобразован как в 'з', так и в 'ж'.

Специальные символы и цифры также имеют свои соответствия, что позволяет обрабатывать 
текст, содержащий специальные символы.

Этот словарь может быть использован в функциях или методах, которые требуют 
преобразования текста из латиницы в кириллицу, например, в приложениях для 
модерации контента или системах перевода.
"""

# # Пока не нашел лучшего вариантка кроме как использовать эту матрицу транслитерации
# # Нормально работает с нормальной скоростью
# transliteration_map = {
# 'a': 'а',
# 'b': 'б',
# 'v': 'в',
# 'w': 'в',
# 'g': 'г',
# 'd': 'д',
# 'e': ['е','ё'],
# 'h': 'х',
# 'yo': 'ё',
# 'zh': 'ж',
# 'z': ['з', 'ж'],
# 'i': ['и', 'й'],
# 'y': ['й', 'и', 'ю', 'у'],
# 'k': ['к'],
# 'l': 'л',
# 'm': 'м',
# 'n': ['н', 'п'],
# 'o': 'о',
# 'oo': 'у',
# 'p': ['п', 'р'],
# 'q': ['к', 'кю'],
# 'r': 'р',

# 's': ['с', 'з'],
# 't': ['т'],
# 'u': ['у', 'и', 'й'],
# 'f': ['ф'],
# 'kh': ['х'],
# 'ts': ['ц'],
# 'ch': ['ч', 'щ'],
# 'sh': ['ш','щ'],
# 'shch': ['щ'],

# 'ck': ['к'],
# 'c': ['ц', 'к'],
# "y'": '',
# "e": "э",

# "yu": "ю",
# "ya": "я",
# '$': ['с', 'з'],
# '(': ['с', 'з',],
# '@': ['а', 'о',],
# '1': ['и', 'ай',],
# '0': ['о',],
# '*': ['о', 'е', 'а', 'и', ],
# '-': ['о', 'е', 'а', 'и', ],

# }


# Расширенный вариант слишком долгая обработка
transliteration_map = {
    "a": "а",
    "b": "б",
    "v": "в",
    "w": "в",
    "g": "г",
    "d": "д",
    "e": "е",
    "h": "х",
    "yo": "ё",
    "zh": "ж",
    "z": ["з", "ж"],
    "i": ["и", "й"],
    "y": ["й", "и", "ю", "у"],
    "k": ["к"],
    "l": "л",
    "m": "м",
    "n": ["н", "п"],
    "o": "о",
    "oo": "у",
    "p": ["п", "р"],
    "q": ["к", "кю"],
    "r": "р",
    "s": ["с", "з"],
    "t": ["т"],
    "u": ["у", "и", "й"],
    "f": ["ф"],
    "kh": ["х"],
    "ts": ["ц"],
    "ch": ["ч", "щ"],
    "sh": ["ш", "щ"],
    "shch": ["щ"],
    "ck": ["к"],
    "c": ["ц", "к"],
    "y'": "",
    # "e": "э",
    "yu": "ю",
    "ya": "я",
    "$": ["с", "з"],
    "(": [
        "с",
        "з",
    ],
    "@": [
        "а",
        "о",
    ],
    "1": [
        "и",
        "ай",
    ],
    "0": [
        "о",
    ],
    "*": [
        "о",
        "е",
        "а",
        "и",
        "н",
        "т",
        "с",
        "л",
        "в",
        "р",
        "б",
        "к",
        "м",
        "п",
        "я",
        "г",
        "з",
        "х",
        "ж",
        "ш",
        "щ",
        "ю",
        "ц",
    ],
    "-": [
        "о",
        "е",
        "а",
        "и",
        "н",
        "т",
        "с",
        "л",
        "в",
        "р",
        "б",
        "к",
        "м",
        "п",
        "я",
        "г",
        "з",
        "х",
        "ж",
        "ш",
        "щ",
        "ю",
        "ц",
    ],
}


# self.CHARS_MAPPING = {
#             "a": ("a", "@", "*", "4"),
#             "i": ("i", "*", "l", "1"),
#             "o": ("o", "*", "0", "@"),
#             "u": ("u", "*", "v"),
#             "v": ("v", "*", "u"),
#             "l": ("l", "1"),
#             "e": ("e", "*", "3"),
#             "s": ("s", "$", "5"),
#             "t": ("t", "7"),
#         }
